# TrussElementCreateTopParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TrussElementCreateTopParam Property
ParameterTypeId Class See Also
---
"Create Top Chord"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TrussElementCreateTopParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussElementCreateTopParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussElementCreateTopParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace